Tekla.Structures.AnalysisInternal.AnalysisEngine
Analysis engine

Tekla.Structures.AnalysisInternal.AnalysisEngine.#ctor
Initializes a new instance of the Tekla.Structures.AnalysisInternal.AnalysisEngine class.

Tekla.Structures.AnalysisInternal.AnalysisEngine.Name
Gets or sets the name of the engine

Tekla.Structures.AnalysisInternal.AnalysisEngine.Type
Gets or sets the engine type

Tekla.Structures.AnalysisInternal.AnalysisEngine.Parameters
Gets or sets the engine parameters

Tekla.Structures.AnalysisInternal.AnalysisEngine.Insert
Insert analysis engine.
Returns: True if successful.

Tekla.Structures.AnalysisInternal.AnalysisEngine.Modify
Modify analysis engine.
Returns: True if successful.

Tekla.Structures.AnalysisInternal.AnalysisEngine.Delete
Delete analysis engine by name.
Returns: True if successful.

Tekla.Structures.AnalysisInternal.AnalysisEngine.Select
Select analysis engine by name.
Returns: True if successful.